<script setup></script>
<template>
  <div class="w-full space-y-4 lg:max-w-[1200px] mx-auto pt-24">
    <div class="text-[#777] text-sm">
      <p>■ 兌換方式</p>
      <p>Step1：於序號兌換頁輸入優惠序號，並點擊『兌換序號』</p>
      <p>Step2：登入台灣大會員</p>
      <p>Step3：檢視並同意合約與條款後確認送出</p>
      <p>Step4：即可完成兌換訂閱</p>
    </div>
    <div class="text-[#777] text-sm border-t-2 pt-4">
      <p>■ 序號使用規範及說明</p>
      <ol class="pl-4 list-decimal">
        <li>
          適用對象：台灣大哥大月租型用戶，且使用序號訂閱時非台灣大哥大 HBO GO
          有效用戶者。
        </li>
        <li>
          輸入序號以兌換使用 HBO GO
          月訂方案特定月租優惠。若訂閱台灣大哥大月租型(月訂方案) HBO GO
          服務(下稱：本服務)，以每 1 個日曆月為 1
          期，並按月透過訂閱本服務之門號電信帳單出帳收取費用。使用者若未取消服務，即視為同意續用，次月將自動以原價自動續訂，直到取消訂閱。本公司於到期日時自動續約本服務
          1
          個日曆月，使用者若於當月服務到期日前取消訂閱，當月費用不退還，惟可繼續使用本服務至當月服務到期日。(自動續訂舉例：9/15
          訂閱本服務，10/14 前(含當天)未取消服務，將於 10/15 扣款 $150 續訂 1
          個日曆月；取消訂閱舉例：9/15 訂閱本服務，9/30
          取消訂閱，仍可使用本服務至
          10/14)。本服務之合約期間(即生效日期及到期日等)
          ，均應以台灣大哥大提供之本服務內容為準據，與 HBO GO 之實際啟用日無關。
        </li>
        <li>一個門號於服務有效周期內僅限兌換一次優惠序號，且優惠不得疊加。</li>
        <li>
          若異動、取消專案、取消HBO
          GO服務或違反專案/服務規定，或門號退租/一退一租、銷號、攜碼移出等門號終止情形發生時，則優惠終止，不可要求更換、轉讓、折現或為其他請求。
        </li>
      </ol>
    </div>
  </div>
</template>

<style lang="scss" scoped></style>
